first-commit-in-SYSU/first-commit-in-SYSU.org
#+TITLE:  中大初犯 / first-commit-in-SYSU
#+AUTHOR: 謝宇恆 / XIE Yuheng
#+EMAIL:  xyheme@gmail.com

* 題解
** 小小語言設計家
   * 用匯編語言來實現一個簡單的程序語言的解釋器
** 小蟬語
   * 蟬語的簡化版本
     因教學之故
     簡化諸多性狀
** 蟬語
   * 蟬語是我所設計的程序語言
     不論是整個系統的構架
     還是語法語義的設計
     都與小蟬語有共通之處 但又非常不同
     工作還在進行中
* 資料
** forth
   * [[http://en.wikipedia.org/wiki/Forth_%28programming_language%29][forth 的 wikipedia 頁面]]
   * [[http://www.bradrodriguez.com/papers/moving1.htm][forth 各種實現技術的比較]]
   * [[http://www.forth.org/][forth 興趣小組]]
   * [[http://www.figuk.plus.com/][英國 forth 興趣小組]]
   * [[http://www.forth.com/starting-forth/sf0/sf0.html][forth 的經典入門教程]]
   * [[http://www.complang.tuwien.ac.at/forth/][其他一些東西]]
   * [[https://github.com/xieyuheng/jonesforth][我爲 jonesforth 作的備份]]
** fasm
   * [[http://flatassembler.net][主頁]]
   * [[http://board.flatassembler.net/][論壇]]
   * fasm 是一個波蘭人在大學時候寫的
     我很欣賞其設計
     關於其設計決策有作者的兩篇文章 :
     1. [[http://flatassembler.net/docs.php?article=ufasm][Understanding the flat assembler]]
     2. [[http://flatassembler.net/docs.php?article=design][Design Principles]]
* 綱要
** 講
   1. 構架
   2. 匯編
   3. 小蟬語
** 讀
   1. 語法與語義
* 工具
** 文本編輯器
   * emacs
** 操作系統
   * linux
* 尾聲
** 開放源代碼運動
** hackerspace & makerspace
   * [[http://www.szdiy.org/][深圳 SZDIY]]
   * [[http://www.chaihuo.org/][深圳 柴火]]
