first-commit-in-SYSU/first-commit-in-SYSU.org.html
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<!-- Created by htmlize-0.59 in css mode. -->
<html>
  <head>
    <meta charset="utf-8">

<!-- http://t.co/dKP3o1e -->
<meta name="HandheldFriendly" content="True">
<meta name="MobileOptimized" content="320">
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no" />

    <title>first-commit-in-SYSU.org</title>
  </head>
  <body>
    <pre>
<span class="org-document-info-keyword">#+TITLE:</span>  <span class="org-document-title">中大初犯 / first-commit-in-SYSU
</span><span class="org-document-info-keyword">#+AUTHOR:</span> <span class="org-document-info">謝宇恆 / XIE Yuheng
</span><span class="org-document-info-keyword">#+EMAIL:</span>  <span class="org-document-info">xyheme@gmail.com
</span>
<span class="org-level-1">* 題解</span>
<span class="org-level-2">** 小小語言設計家</span>
   * 用匯編語言來實現一個簡單的程序語言的解釋器
<span class="org-level-2">** 小蟬語</span>
   * 蟬語的簡化版本
     因教學之故
     簡化諸多性狀
<span class="org-level-2">** 蟬語</span>
   * 蟬語是我所設計的程序語言
     不論是整個系統的構架
     還是語法語義的設計
     都與小蟬語有共通之處 但又非常不同
     工作還在進行中
<span class="org-level-1">* 資料</span>
<span class="org-level-2">** forth</span>
   * <span class="org-link">[[http://en.wikipedia.org/wiki/Forth_%28programming_language%29][forth 的 wikipedia 頁面]]</span>
   * <span class="org-link">[[http://www.bradrodriguez.com/papers/moving1.htm][forth 各種實現技術的比較]]</span>
   * <span class="org-link">[[http://www.forth.org/][forth 興趣小組]]</span>
   * <span class="org-link">[[http://www.figuk.plus.com/][英國 forth 興趣小組]]</span>
   * <span class="org-link">[[http://www.forth.com/starting-forth/sf0/sf0.html][forth 的經典入門教程]]</span>
   * <span class="org-link">[[http://www.complang.tuwien.ac.at/forth/][其他一些東西]]</span>
   * <span class="org-link">[[https://github.com/xieyuheng/jonesforth][我爲 jonesforth 作的備份]]</span>
<span class="org-level-2">** fasm</span>
   * <span class="org-link">[[http://flatassembler.net][主頁]]</span>
   * <span class="org-link">[[http://board.flatassembler.net/][論壇]]</span>
   * fasm 是一個波蘭人在大學時候寫的
     我很欣賞其設計
     關於其設計決策有作者的兩篇文章 :
     1. <span class="org-link">[[http://flatassembler.net/docs.php?article=ufasm][Understanding the flat assembler]]</span>
     2. <span class="org-link">[[http://flatassembler.net/docs.php?article=design][Design Principles]]</span>
<span class="org-level-1">* 綱要</span>
<span class="org-level-2">** 講</span>
   1. 構架
   2. 匯編
   3. 小蟬語
<span class="org-level-2">** 讀</span>
   1. 語法與語義
<span class="org-level-1">* 工具</span>
<span class="org-level-2">** 文本編輯器</span>
   * emacs
<span class="org-level-2">** 操作系統</span>
   * linux
<span class="org-level-1">* 尾聲</span>
<span class="org-level-2">** 開放源代碼運動</span>
<span class="org-level-2">** hackerspace &amp; makerspace</span>
   * <span class="org-link">[[http://www.szdiy.org/][深圳 SZDIY]]</span>
   * <span class="org-link">[[http://www.chaihuo.org/][深圳 柴火]]</span>
</pre>
  </body>
</html>
